Revit 2027 API
Field.GetSpecTypeId Method
 Gets the spec describing the values stored in this field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetSpecTypeId()
Public Function GetSpecTypeId As ForgeTypeId
public:
ForgeTypeId^ GetSpecTypeId()
member GetSpecTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
 Identifier of the spec.
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace